/*
 * 대입연산자
 * -----------------------
 * 연산순서: 일반은 좌 -> 우
 * 		   대입은 좌 <- 우 (뒤에서부터 계산)
 * --------------------------------------
 * =
 * --------------------------------------
 * 복합대입연산자
 * ***+= : 누적(총합) 예)1부터 100까지 더해라
 * ***-=
 * *=
 * /=
 * %=
 * <<=
 * >>=
 * &=
 * |=
 * ^=
 * ---------------------------------------
 * 
 * int a=10;
 * a+=10; ==> a=a+10 ==> 20
 * a+=1; a=a+1; a++; ++a;
 * 
 * a-=20 ==> a=a-20
 * a*=10 ==> a=a*10
 * 
 * 제어문을 사용할 경우 비교연산자, 논리연산자, 부정연산자 포함
 * 
 */
public class 대입연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int a=10;
		a+=3; // a=a+3
		System.out.println(a);
		
	}

}
